Revit 2027 API
View.RevealConstraintsMode Property
 Indicates whether the Reveal Constraints mode is activated in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool RevealConstraintsMode { get; set; }
Public Property RevealConstraintsMode As Boolean
	Get
	Set
public:
property bool RevealConstraintsMode {
	bool get ();
	void set (bool value);
}
member RevealConstraintsMode : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  When setting this property: View has a view type that does not allow Reveal Constraints mode to be activated.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace